<?php
namespace app\components;

use Yii;

class Common extends yii\base\Component
{
    public static function slugify($str) {
        $str = self::cleanString($str);
        $str = preg_replace('/[^\w\d\-\ ]/', '', $str);
        $str = str_replace(' ', '-', $str);
        return preg_replace('/\-{2,}/', '-', $str);
    }

    /**
     *
     * Create an url string
     * @staticvar ARRAY $charMap
     * @param STRING $string
     * @return STRING
     */
    public static function cleanString($string)
    {
        static $charMap = array(
                    "Đ" => "D","đ" => "D",
                    'ê' => 'e','ế' => 'e','ề' => 'e','ệ' => 'e','ễ' => 'e','ể' => 'e',
                    'ơ' => 'o','ớ' => 'o','ờ' => 'o','ở' => 'o','ợ' => 'o','ỡ' => 'o',
                    'é' => 'e','è' => 'e','ẻ' => 'e','ẹ' => 'e','ẽ' => 'e',
                    'ó' => 'o','ò' => 'o','ỏ' => 'o','õ' => 'o','ọ' => 'o',
                    'ì' => 'i','í' => 'i','ỉ' => 'i','ị' => 'i','ĩ' => 'i',
                    "á" => "a","à" => "a","ả" => "a","ạ" => "a","ã" => "a",
                    "â" => "a","ấ" => "a","ầ" => "a","ậ" => "a","ẩ" => "a","ẫ" => "a",
                    "ẵ" => "a","ắ" => "a","ặ" => "a","ẳ" => "a","ằ" => "a","ă" => "a",
                    "ỷ" => "y","ý" => "y","ỳ" => "y","ỵ" => "y","ỹ" => "y",
                    "ư" => "u","ử" => "u","ứ" => "u","ừ" => "u","ự" => "u","ữ" => "u",
                    "ụ" => "u","ú" => "u","ù" => "u","ủ" => "u","ũ" => "u",
                    "ô" => "o","ố" => "o","ồ" => "o","ộ" => "o","ổ" => "o","ỗ" => "o",
                    'Ê' => 'e','Ế' => 'e','Ề' => 'e','Ệ' => 'e','Ễ' => 'e','Ể' => 'e',
                    'Ơ' => 'o','Ớ' => 'o','Ờ' => 'o','Ở' => 'o','Ợ' => 'o','Ỡ' => 'o',
                    'É' => 'e','È' => 'e','Ẻ' => 'e','Ẹ' => 'e','Ẽ' => 'e',
                    'Ó' => 'o','Ò' => 'o','Ỏ' => 'o','Õ' => 'o','Ọ' => 'o',
                    'Ì' => 'i','Ì' => 'i','Ỉ' => 'i','Ị' => 'i','Ĩ' => 'i',
                    "Á" => "a","À" => "a","Ả" => "a","Ạ" => "a","Ã" => "a",
                    "Â" => "a","Ấ" => "a","Ầ" => "a","Ậ" => "a","Ẩ" => "a","Ẫ" => "a",
                    "Ẵ" => "a","Ắ" => "a","Ằ" => "a","Ẳ" => "a","Ặ" => "a","Ă" => "a",
                    "Ỷ" => "y","Ý" => "y","Ỳ" => "y","Ỵ" => "y","Ỹ" => "y",
                    "Ư" => "u","Ử" => "u","Ứ" => "u","Ừ" => "u","Ự" => "u","Ữ" => "u",
                    "Ụ" => "u","Ú" => "u","Ù" => "u","Ủ" => "u","Ũ" => "u",
                    "Ô" => "o","Ố" => "o","Ồ" => "o","Ộ" => "o","Ổ" => "o","Ỗ" => "o",
                    "Ã "=>"a","áº£"=>"a","Ã£"=>"a","Ã¡"=>"a","áº¡"=>"a","Äƒ"=>"a","áº±"=>"a","áº³"=>"a","áºµ"=>"a","áº¯"=>"a","áº·"=>"a","Ã¢"=>"a","áº§"=>"a","áº©"=>"a","áº«"=>"a","áº¥"=>"a","áº­"=>"a",
                    "Ä‘"=>"d",
                    "Ã¨"=>"e","áº»"=>"e","áº½"=>"e","Ã©"=>"e","áº¹"=>"e","Ãª"=>"e","á»�"=>"e","á»ƒ"=>"e","á»…"=>"e","áº¿"=>"e","á»‡"=>"e",
                    "Ã¬"=>'i',"á»‰"=>'i',"Ä©"=>'i',"Ã­"=>'i',"á»‹"=>'i',
                    "Ã²"=>'o',"á»�"=>'o',"Ãµ"=>"o","Ã³"=>"o","á»�"=>"o","Ã´"=>"o","á»“"=>"o","á»•"=>"o","á»—"=>"o","á»‘"=>"o","á»™"=>"o","Æ¡"=>"o","á»�"=>"o","á»Ÿ"=>"o","á»¡"=>"o","á»›"=>"o","á»£"=>"o",
                    "Ã¹"=>"u","á»§"=>"u","Å©"=>"u","Ãº"=>"u","á»¥"=>"u","Æ°"=>"u","á»«"=>"u","á»­"=>"u","á»¯"=>"u","á»©"=>"u","á»±"=>"u",
                    "á»³"=>"y","á»·"=>"y","á»¹"=>"y","Ã½"=>"y","á»µ"=>"y",
                    "Ã€"=>"A","áº¢"=>"A","Ãƒ"=>"A","Ã�"=>"A","áº "=>"A","Ä‚"=>"A","áº°"=>"A","áº²"=>"A","áº´"=>"A","áº®"=>"A","áº¶"=>"A","Ã‚"=>"A","áº¦"=>"A","áº¨"=>"A","áºª"=>"A","áº¤"=>"A","áº¬"=>"A",
                    "Ä�"=>"D",
                    "Ãˆ"=>"E","áºº"=>"E","áº¼"=>"E","Ã‰"=>"E","áº¸"=>"E","ÃŠ"=>"E","á»€"=>"E","á»‚"=>"E","á»„"=>"E","áº¾"=>"E","á»†"=>"E",
                    "ÃŒ"=>"I","á»ˆ"=>"I","Ä¨"=>"I","Ã�"=>"I","á»Š"=>"I",
                    "Ã’"=>"O","á»Ž"=>"O","Ã•"=>"O","Ã“"=>"O","á»Œ"=>"O","Ã”"=>"O","á»’"=>"O","á»”"=>"O","á»–"=>"O","á»�"=>"O","á»˜"=>"O","Æ "=>"O","á»œ"=>"O","á»ž"=>"O","á» "=>"O","á»š"=>"O","á»¢"=>"O",
                    "Ã™"=>"U","á»¦"=>"U","Å¨"=>"U","Ãš"=>"U","á»¤"=>"U","Æ¯"=>"U","á»ª"=>"U","á»¬"=>"U","á»®"=>"U","á»¨"=>"U","á»°"=>"U",
                    "á»²"=>"Y","á»¶"=>"Y","á»¸"=>"Y","Ã�"=>"Y","á»´"=>"Y"
        );

        $string = strtr($string, $charMap);

        return strtolower($string);
    }

    public function getJsDateLang(){
        return [
            'days' => [
                Yii::t('app', 'Sunday'),
                Yii::t('app', 'Monday'),
                Yii::t('app', 'Tuesday'),
                Yii::t('app', 'Wednesday'),
                Yii::t('app', 'Thursday'),
                Yii::t('app', 'Friday'),
                Yii::t('app', 'Saturday'),
            ],
            'months' => [
                Yii::t('app', 'January'),
                Yii::t('app', 'February'),
                Yii::t('app', 'March'),
                Yii::t('app', 'April'),
                Yii::t('app', 'May'),
                Yii::t('app', 'June'),
                Yii::t('app', 'July'),
                Yii::t('app', 'August'),
                Yii::t('app', 'September'),
                Yii::t('app', 'October'),
                Yii::t('app', 'November'),
                Yii::t('app', 'December'),
            ],
            
        ];
    }
}